#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_appsync_graphql_api.covidtracker will be updated in-place
  ~ resource "aws_appsync_graphql_api" "covidtracker" {
        arn                 = "arn:aws:appsync:ap-southeast-1:780046271874:apis/yb5auvtbovb6rkgedsrn3jrvne"
        authentication_type = "API_KEY"
        id                  = "yb5auvtbovb6rkgedsrn3jrvne"
        name                = "covidtracker-graphql"
      ~ schema              = <<~EOT
            schema {
                query: Query
            }
          + 
            type Query {
          -   cases: [Case!]!
          + 
          +   cases(
          +     # Region of the case
          +     region: String,
          +     # Province of the case
          +     province: String,
          +     # City of the case
          +     city: String,
          +     # Pagination offset
          +     offset: Int,
          +     # Pagination limit
          +     limit: Int
          +   ): [Case!]!
          + 
              case(caseNo: String!): Case!
          + 
              ageGenderDistribution(
                # Type of the case
                type: Type!
              ): [AgeGenderDistribution!]!
          + 
              accumulation(
                # Type of the case
                type: Type!
              ): [Accumulation!]!
          -   statistics: CaseStatistic!
          + 
          +   statistics(
          +     # Region of the case
          +     region: String,
          +     # Province of the case
          +     province: String,
          +     # City of the case
          +     city: String
          +   ): CaseStatistic!
          + 
          +   region(
          +     # Search query
          +     query: String
          +   ): [SelectionItem]
          + 
          +   province(
          +     # Search query
          +     query: String,
          +     # Region of the province
          +     region: String
          +   ): [SelectionItem]
          + 
          +   city(
          +     # Search query
          +     query: String,
          +     # Province of the city
          +     province: String,
          +     # Region of the city
          +     region: String
          +   ): [SelectionItem]
          +   
            }
          + 
            type Accumulation {
              # Field accumulated against
              accumulator: AWSDateTime!
            
              # Total value of the accumulation
              value: Int!
            }
            
            input AccumulationInput {
              # Type of the case
              type: Type!
            }
            
            # Case distribution by age and gender
            type AgeGenderDistribution {
              # Age group
              ageGroup: String
            
              # Gender
              sex: String
            
              # Total value of distribution
              value: Int
            }
            
            # A COVID19 case
            type Case {
              # Case number assigned by DOH
              caseNo: String!
            
              # Age of the case patient
              age: Int
            
              # Age group of the case patient
              ageGroup: String
            
              # Date of disease confirmation
              dateConfirmed: AWSDateTime
            
              # Date of disease recovery
              dateRecovered: AWSDateTime
            
              # Date of death
              dateDied: AWSDateTime
            
              # Type of removal. Recovered or Died
              removalType: String
            
              # Date of removal
              dateRemoved: AWSDateTime
            
              # Person was admitted to a health facility
              admitted: Boolean
            
              # Health status of person
              healthStatus: String
            
              # Region of residence
              region: String
            
              # Province of residence
              province: String
            
              # City of residence
              city: String
            
              # Date of entity insertion
              insertedAt: AWSDateTime!
            
              # Date of entity modification
              updatedAt: AWSDateTime!
            }
            
            # COVID19 case statistics
            type CaseStatistic {
              # Total confirmed cases
              total: Int!
            
              # New confirmed cases
              new: Int!
            
              # Number of cases marked dead
              dead: Int!
            
              # New cases marked dead
              deadNew: Int!
            
              # Number of cases marked recovered
              recovered: Int!
            
              # New cases marked recovered
              recoveredNew: Int!
            
              # Number of cases marked admitted and have not died or recovered
              admitted: Int!
            
              # New cases marked admitted and have not died or recovered
              admittedNew: Int!
            }
            
          + # Selection item for user interface
          + type SelectionItem {
          +   # User interface display
          +   display: String
          + 
          +   # Actual value
          +   value: String
          + }
          + 
            # The javascript `Date` as string. Type represents date and time as the ISO Date string. 
            scalar AWSDateTime
            
            # Type of the case
            enum Type {
              TOTAL
              ADMITTED
              DIED
              RECOVERED
            }
        EOT
        tags                = {}
        uris                = {
            "GRAPHQL"  = "https://qbqrlzgkwjfmvmugfdzy4bbt3y.appsync-api.ap-southeast-1.amazonaws.com/graphql"
            "REALTIME" = "wss://qbqrlzgkwjfmvmugfdzy4bbt3y.appsync-realtime-api.ap-southeast-1.amazonaws.com/graphql"
        }
        xray_enabled        = false
    }

  # aws_lambda_function.graph_resolver will be updated in-place
  ~ resource "aws_lambda_function" "graph_resolver" {
        arn                            = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver"
        filename                       = "./lambda_functions/graph-resolver/function.zip"
        function_name                  = "graph-resolver"
        handler                        = "index.handler"
        id                             = "graph-resolver"
        invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver/invocations"
      ~ last_modified                  = "2020-05-02T13:25:04.178+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 256
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-southeast-1:780046271874:function:graph-resolver:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::780046271874:role/graph-resolver"
        runtime                        = "nodejs12.x"
      ~ source_code_hash               = "Dns9xYUxSgc/TNJO7HsoAFDpWfmkjH3wCTTiT+cln84=" -> "Z/CTBWqnt8uMxtInR0tCwvYvX0T0u/SHx++wt28SQ8A="
        source_code_size               = 1084043
        tags                           = {}
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "COVIDTRACKER_DB_CONNECTION_SECRET_ID" = "covidrds"
                "environment"                          = "Production"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["city"] will be created
  + resource "aws_appsync_resolver" "query_resolver" {
      + api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
      + arn               = (known after apply)
      + data_source       = "covidtracker_graph_datasource"
      + field             = "city"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "city",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
      + response_template = "$utils.toJson($context.result)"
      + type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["province"] will be created
  + resource "aws_appsync_resolver" "query_resolver" {
      + api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
      + arn               = (known after apply)
      + data_source       = "covidtracker_graph_datasource"
      + field             = "province"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "province",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
      + response_template = "$utils.toJson($context.result)"
      + type              = "Query"
    }

  # module.appsync_queries.aws_appsync_resolver.query_resolver["region"] will be created
  + resource "aws_appsync_resolver" "query_resolver" {
      + api_id            = "yb5auvtbovb6rkgedsrn3jrvne"
      + arn               = (known after apply)
      + data_source       = "covidtracker_graph_datasource"
      + field             = "region"
      + id                = (known after apply)
      + kind              = "UNIT"
      + request_template  = <<~EOT
            {
                "version": "2017-02-28",
                "operation": "Invoke",
                "payload": {
                    "field": "region",
                    "args": $utils.toJson($context.arguments)
                }
            }
        EOT
      + response_template = "$utils.toJson($context.result)"
      + type              = "Query"
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Infra Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `core`, Workspace: `default`*
